Revit 2027 API
ParameterTypeId.RbsPipeJointtypeParam Property
 "Connection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeJointtypeParam { get; }
Public Shared ReadOnly Property RbsPipeJointtypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeJointtypeParam {
	ForgeTypeId^ get ();
}
static member RbsPipeJointtypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace